Documents/РабочийГрафикМонтажников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>РабочийГрафикМонтажников</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.СвободныеМонтажники</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Города</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Табель</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>День</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоМонтажников</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДеньНедели</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>11</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/СвободныеМонтажники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<AccumulationRegister>
		<Properties>
			<Name>СвободныеМонтажники</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоМонтажников</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоМонтажей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Города</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/РабочийГрафикМонтажников/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТабель(Команда)
	
	ЗаполнитьТабельНаСервере();
	ОбновитьКоличествоМонтажей();
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьТабельНаСервере()

	Объект.Табель.Очистить();
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	ДокОбъект.ЗаполнитьТабель(Объект.Дата);
	
	ЗначениеВРеквизитФормы(ДокОбъект, "Объект");
    
	
КонецФункции // ЗаполнитьТабель()

&НаКлиенте
Процедура ТабельПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабельПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаСервере
Функция ОбновитьКоличествоМонтажей()
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = "";
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода",НачалоМесяца(Объект.Дата) );
	Запрос.УстановитьПараметр("КонецПериода",КонецМесяца(Объект.Дата));
	Запрос.УстановитьПараметр("Город",Объект.Город);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СвободныеМонтажникиОбороты.Период КАК Дата,
	|	СвободныеМонтажникиОбороты.КоличествоМонтажейОборот КАК КоличествоМонтажей
	|ИЗ
	|	РегистрНакопления.СвободныеМонтажники.Обороты(&НачалоПериода, &КонецПериода, День, Город = &Город) КАК СвободныеМонтажникиОбороты
	|
	|УПОРЯДОЧИТЬ ПО
	|	СвободныеМонтажникиОбороты.Период
	|ИТОГИ
	|	СУММА(КоличествоМонтажей)
	|ПО
	|	Дата ПЕРИОДАМИ(ДЕНЬ, &НачалоПериода, &КонецПериода)";
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Дата", "ВСЕ");
	
	Для каждого Строка Из Объект.Табель Цикл
		
		Выборка.Следующий();
		
		Строка.КоличествоМонтажей = Выборка.КоличествоМонтажей; 
		
	КонецЦикла;
	
КонецФункции // ОбновитьСостояниеМонтажей()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	 ОбновитьКоличествоМонтажей();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	
	 ОбновитьКоличествоМонтажей();
	
КонецПроцедуры
